In [1]:
import pandas as pd

In [3]:
marks = pd.Series([12,40,33,60])

In [4]:
marks

0    12
1    40
2    33
3    60
dtype: int64

In [6]:
marks = pd.Series([12,40,33,60], index=["Gourab", "saer", "soname", "sreya"])
marks

Gourab    12
saer      40
soname    33
sreya     60
dtype: int64

In [7]:
marks["Gourab"]

12

frames dat sets

In [15]:
data = {
    "Name" : ["Gourab", "saer", "soname", "sreya"],
    "age" : [18,30,27,14],
    "mark" : [12,40,33,18],
}

In [16]:
frame_Data = pd.DataFrame(data)
frame_Data

     Name  age  mark
0  Gourab   18    12
1    saer   30    40
2  soname   27    33
3   sreya   14    18

In [17]:
frame_Data.index

RangeIndex(start=0, stop=4, step=1)

In [25]:
frame_Data.columns

Index(['Name', 'age', 'mark'], dtype='object')

In [26]:
frame_Data.columns = ['naam', 'age', 'score']

In [27]:
frame_Data

     naam  age  score
0  Gourab   18     12
1    saer   30     40
2  soname   27     33
3   sreya   14     18